integrationtest/src/test/resources/createDelegationsRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dgws="http://www.medcom.dk/dgws/2006/04/dgws-1.0.xsd" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <CreateDelegationsRequest xmlns="http://nsi.dk/bemyndigelse/2017/08/01/">
            <Create>
                <DelegatorCpr>0501792275</DelegatorCpr>
                <DelegateeCpr>1111112222</DelegateeCpr>
                <SystemId>FMK</SystemId>
                <RoleId>Læge</RoleId>
                <State>Godkendt</State>
                <ListOfPermissionIds>
                    <PermissionId>SundhedsfagligOpslag</PermissionId>
                    <PermissionId>Lægemiddelordination</PermissionId>
                    <PermissionId>Effektuering</PermissionId>
                    <PermissionId>Privatmarkering</PermissionId>
                    <PermissionId>VisPrivatmarkeretVærdispring</PermissionId>
                </ListOfPermissionIds>
            </Create>
            <Create>
                <DelegatorCpr>0501792275</DelegatorCpr>
                <DelegateeCpr>0101010101</DelegateeCpr>
                <SystemId>FMK</SystemId>
                <RoleId>Læge</RoleId>
                <State>Godkendt</State>
                <ListOfPermissionIds>
                    <PermissionId>SundhedsfagligOpslag</PermissionId>
                    <PermissionId>Lægemiddelordination</PermissionId>
                    <PermissionId>Effektuering</PermissionId>
                    <PermissionId>Privatmarkering</PermissionId>
                    <PermissionId>VisPrivatmarkeretVærdispring</PermissionId>
                </ListOfPermissionIds>
            </Create>
        </CreateDelegationsRequest>
    </soapenv:Body>
</soapenv:Envelope>
