integrationtest/src/test/resources/deleteDelegationsRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dgws="http://www.medcom.dk/dgws/2006/04/dgws-1.0.xsd" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns="http://nsi.dk/bemyndigelse/2017/08/01/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:DeleteDelegationsRequest>
            <ns:DelegatorCpr>0501792275</ns:DelegatorCpr>
            <ns:ListOfDelegationIds>
                <ns:DelegationId>DELEGATION_ID</ns:DelegationId>
            </ns:ListOfDelegationIds>
        </ns:DeleteDelegationsRequest>
    </soapenv:Body>
</soapenv:Envelope>
