service/src/test/resources/putFMKMetadataRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dgws="http://www.medcom.dk/dgws/2006/04/dgws-1.0.xsd" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <PutMetadataRequest xmlns="http://nsi.dk/bemyndigelse/2017/08/01/">
            <Domain>Trifork</Domain>
            <SystemId>FMK</SystemId>
            <SystemLongName>Det Fælles Medicinkort</SystemLongName>
            <Permission>
                <PermissionId>BorgerOpslag</PermissionId>
                <PermissionDescription>Borger opslag</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>SundhedsfagligOpslag</PermissionId>
                <PermissionDescription>Sundhedsfagligt opslag</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>Recept</PermissionId>
                <PermissionDescription>Opret eller annuller recept</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>Lægemiddelordination</PermissionId>
                <PermissionDescription>Opret, ret eller seponer lægemiddelordination</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>Effektuering</PermissionId>
                <PermissionDescription>Opret, ret eller slet effektuering (indgivelse/udlevering af et lægemiddel)</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>Privatmarkering</PermissionId>
                <PermissionDescription>Sæt/fjern privatmarkering</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>VisPrivatmarkeretVærdispring</PermissionId>
                <PermissionDescription>Vis privatmarkeret med værdispring</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>VisPrivatmarkeretSamtykke</PermissionId>
                <PermissionDescription>Vis privatmarkeret med samtykke</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>Suspendering</PermissionId>
                <PermissionDescription>Indlæg/udskriv via FMK-snitflade 1.4.0</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>Afstemning</PermissionId>
                <PermissionDescription>Sæt markering for ajourføring</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>LøsRecept</PermissionId>
                <PermissionDescription>Ændring af status for løs recept (Opret ordination på baggrund af løs recept eller marker løs recept ”ikke aktuel”)</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>BestilEffektuering</PermissionId>
                <PermissionDescription>Bestil udlevering eller ny recept</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>Tilknytning</PermissionId>
                <PermissionDescription>Opret tilknytning til medicinadministration og Indlæg/udskriv fra FMK 1.4.2 og 1.4.4</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>RegistrerKliniskStamdata</PermissionId>
                <PermissionDescription>Registrer klinisk stamdata</PermissionDescription>
            </Permission>
            <EnableAsteriskPermission>true</EnableAsteriskPermission>
            <Role>
                <RoleId>Læge</RoleId>
                <RoleDescription>Læge</RoleDescription>
                <DelegatablePermissions>
                    <PermissionId>SundhedsfagligOpslag</PermissionId>
                    <PermissionId>Lægemiddelordination</PermissionId>
                    <PermissionId>Effektuering</PermissionId>
                    <PermissionId>Privatmarkering</PermissionId>
                    <PermissionId>VisPrivatmarkeretVærdispring</PermissionId>
                    <PermissionId>VisPrivatmarkeretSamtykke</PermissionId>
                    <PermissionId>Suspendering</PermissionId>
                    <PermissionId>Afstemning</PermissionId>
                    <PermissionId>LøsRecept</PermissionId>
                    <PermissionId>BestilEffektuering</PermissionId>
                    <PermissionId>Tilknytning</PermissionId>
                    <PermissionId>RegistrerKliniskStamdata</PermissionId>
                </DelegatablePermissions>
                <UndelegatablePermissions>
                    <PermissionId>Recept</PermissionId>
                </UndelegatablePermissions>
            </Role>
            <Role>
                <RoleId>Tandlæge</RoleId>
                <RoleDescription>Tandlæge</RoleDescription>
                <DelegatablePermissions>
                    <PermissionId>SundhedsfagligOpslag</PermissionId>
                    <PermissionId>Lægemiddelordination</PermissionId>
                    <PermissionId>Effektuering</PermissionId>
                    <PermissionId>Privatmarkering</PermissionId>
                    <PermissionId>VisPrivatmarkeretVærdispring</PermissionId>
                    <PermissionId>VisPrivatmarkeretSamtykke</PermissionId>
                    <PermissionId>Suspendering</PermissionId>
                    <PermissionId>Afstemning</PermissionId>
                    <PermissionId>LøsRecept</PermissionId>
                    <PermissionId>BestilEffektuering</PermissionId>
                    <PermissionId>Tilknytning</PermissionId>
                </DelegatablePermissions>
                <UndelegatablePermissions>
                    <PermissionId>Recept</PermissionId>
                </UndelegatablePermissions>
            </Role>
            <Role>
                <RoleId>Jordemoder</RoleId>
                <RoleDescription>Jordemoder</RoleDescription>
                <DelegatablePermissions>
                    <PermissionId>SundhedsfagligOpslag</PermissionId>
                    <PermissionId>Effektuering</PermissionId>
                    <PermissionId>Privatmarkering</PermissionId>
                    <PermissionId>VisPrivatmarkeretVærdispring</PermissionId>
                    <PermissionId>VisPrivatmarkeretSamtykke</PermissionId>
                    <PermissionId>Suspendering</PermissionId>
                    <PermissionId>BestilEffektuering</PermissionId>
                    <PermissionId>Tilknytning</PermissionId>
                </DelegatablePermissions>
            </Role>
            <Role>
                <RoleId>Sygeplejerske</RoleId>
                <RoleDescription>Sygeplejerske</RoleDescription>
                <DelegatablePermissions>
                    <PermissionId>SundhedsfagligOpslag</PermissionId>
                    <PermissionId>Effektuering</PermissionId>
                    <PermissionId>Privatmarkering</PermissionId>
                    <PermissionId>VisPrivatmarkeretVærdispring</PermissionId>
                    <PermissionId>VisPrivatmarkeretSamtykke</PermissionId>
                    <PermissionId>Suspendering</PermissionId>
                    <PermissionId>BestilEffektuering</PermissionId>
                    <PermissionId>Tilknytning</PermissionId>
                </DelegatablePermissions>
            </Role>
            <Role>
                <RoleId>Social- og sundhedsassistent</RoleId>
                <RoleDescription>Social- og sundhedsassistent</RoleDescription>
                <DelegatablePermissions>
                    <PermissionId>SundhedsfagligOpslag</PermissionId>
                    <PermissionId>Effektuering</PermissionId>
                    <PermissionId>Privatmarkering</PermissionId>
                    <PermissionId>VisPrivatmarkeretVærdispring</PermissionId>
                    <PermissionId>VisPrivatmarkeretSamtykke</PermissionId>
                    <PermissionId>Suspendering</PermissionId>
                    <PermissionId>BestilEffektuering</PermissionId>
                    <PermissionId>Tilknytning</PermissionId>
                </DelegatablePermissions>
            </Role>
            <Role>
                <RoleId>Social- og sundhedshjælper</RoleId>
                <RoleDescription>Social- og sundhedshjælper</RoleDescription>
                <DelegatablePermissions>
                    <PermissionId>Privatmarkering</PermissionId>
                </DelegatablePermissions>
            </Role>
            <Role>
                <RoleId>Sundhedsplejerske</RoleId>
                <RoleDescription>Sundhedsplejerske</RoleDescription>
                <DelegatablePermissions>
                    <PermissionId>Privatmarkering</PermissionId>
                </DelegatablePermissions>
            </Role>
            <Role>
                <RoleId>Farmaceut</RoleId>
                <RoleDescription>Farmaceut</RoleDescription>
                <DelegatablePermissions>
                    <PermissionId>Privatmarkering</PermissionId>
                </DelegatablePermissions>
            </Role>
            <Role>
                <RoleId>Farmakonom</RoleId>
                <RoleDescription>Farmakonom</RoleDescription>
                <DelegatablePermissions>
                    <PermissionId>Privatmarkering</PermissionId>
                </DelegatablePermissions>
            </Role>
            <Role>
                <RoleId>Assistent for Læge</RoleId>
                <RoleDescription>Assistent for Læge</RoleDescription>
            </Role>
            <Role>
                <RoleId>Assistent for Tandlæge</RoleId>
                <RoleDescription>Assistent for Tandlæge</RoleDescription>
            </Role>
            <Role>
                <RoleId>Assistent for Jordemoder</RoleId>
                <RoleDescription>Assistent for Jordemoder</RoleDescription>
            </Role>
            <Role>
                <RoleId>Assistent for Sygeplejer</RoleId>
                <RoleDescription>Assistent for Sygeplejer</RoleDescription>
            </Role>
            <Role>
                <RoleId>Assistent for Social- og sundhedsassistent</RoleId>
                <RoleDescription>Assistent for Social- og sundhedsassistent</RoleDescription>
            </Role>
            <Role>
                <RoleId>Borger</RoleId>
                <RoleDescription>Borger</RoleDescription>
            </Role>
            <Role>
                <RoleId>Forældermyndighed</RoleId>
                <RoleDescription>Forældermyndighed</RoleDescription>
            </Role>
            <Role>
                <RoleId>Værge</RoleId>
                <RoleDescription>Værge</RoleDescription>
            </Role>
            <Role>
                <RoleId>Web administrator</RoleId>
                <RoleDescription>Web administrator</RoleDescription>
            </Role>
            <Role>
                <RoleId>Apoteker</RoleId>
                <RoleDescription>Apoteker</RoleDescription>
                <DelegatablePermissions>
                    <PermissionId>SundhedsfagligOpslag</PermissionId>
                    <PermissionId>Privatmarkering</PermissionId>
                    <PermissionId>VisPrivatmarkeretSamtykke</PermissionId>
                </DelegatablePermissions>
            </Role>
        </PutMetadataRequest>
    </soapenv:Body>
</soapenv:Envelope>
